print('Приветствую тебя в этом словоре неизвестных тебе слов!')
print('Тут есть такие слова как, лол, кринж, чушпан, сигма и эшкере')
while True:
    wordsname = {
                "КРИНЖ": "Что-то очень странное или стыдное",
                "ЛОЛ": "Что-то очень смешное",
                "ЧУШПАН": "Это описание человека, который чужой в любой компании, «лох», никчемный.",
                "СИГМА": "интернет-мем и термин из интернет-сленга, которым называют мужчин-одиночек и независимых от общества личностей.",
                "ЭШКЕРЕ": "Это не речь сумасшедшего, а всего лишь слово из молодежного слэнга. Сейчас это слово используют как попало — у молодежи оно означает и восхищение, и призыв к действию, и просто эмоциональный возглас, напоминающий короткую кричалку.",
                }
    words = input("Введите непонятное слово (большими буквами!): ")
    
    if words in wordsname.keys():
        print(wordsname[words])
    else:
        print('Увы, такого слова не нашлось.')
